<?php 

$admin = [968552906]; // آیدی عددی ادمین رو وارد کنید اینجا

$bot_is_now_on = "✅ربات فعال شد";
$bot_is_now_off = "🚫ربات غیر فعال شد";

$bot_updating_message = "💠ربات در حال به روز رسانی می باشد. بعدا تلاش کنید";
$in_future = "این بخش در آینده فعال خواهد شد";

$you_are_blocked = "⚠️شما در لیست سیاه ربات قرار گرفته اید!";
$not_registered = "⚠️Error occurd!";

$welcome_to_admin = "ادمین گرامی خوش آمدید";
$welcome_to_users = "کاربر گرامی خوش آمدید\nجهت استفاده از این ربات شما باید «توکن» و «کانال ایتا» را در ربات ثبت کنید. اگر نمیدانید چطور این کار را انجام دهید لطفا از صفحه کلید ربات دکمه «راهنما» را لمس کنید.\n\nکانال اطلاع رسانی ربات:\n@EitaaSender_Channel";
$return_home_page = "به صفحه اصلی برگشتید";
$use_keyboard = "از صفحه کلید استفاده کنید";

$key_manage_bot = "بخش مدیریت";
$key_auto_sender = "ارسال خودکار";
$key_send_contents = "ارسال محتوا";
$key_change_text = "تغییر متن";
$key_signature = "امضا";
$key_register_token = "ثبت توکن";
$key_register_channel = "ثبت کانال";
$key_account = "حساب کاربری";
$key_help = "راهنما";

$key_from_url = "از لینک";
$key_select_channel = "انتخاب کانال";
$key_from_telegram = "از تلگرام";
$key_back = "برگشت";

$t_button_delete = "❌ حذف";

$about_auto_sender = "🔰ارسال خودکار چیست؟\nبا فعال کردن این قابلیت محتوایی که به کانال تلگرامی خود ارسال میکنید به صورت خودکار به کانال ایتای شما منتقل خواهند شد.";
$about_signature = "🔰امضا چیست؟\nمتنی ست که به انتهای پست ها اضافه می شود. (سقف کاراکتر مجاز 100)";
$about_change_text = "🔰تغییر متن چیست\nاین قابلیت برای تغییر یک متن خاص در پست ها استفاده می شود.\n\n🔹اصلی: متنی که باید تغییر کند\n🔸جایگزین: متنی که جایگزین می شود";
$send_contents_message = "🔻محتوای خود را جهت انتقال بفرستید🔻\n(سقف مجاز آپلود برای هر فایل 100 مگابایت)\n\nکانال مقصد: ";


$enter_token = "لطفا توکن ایتایار خود را ارسال کنید";
$token_registered = "✅ توکن با موفقیت ثبت شد";
$token_exists = "این توکن وجود دارد !";
$token_invalid = "⚠️ توکن صحیح نیست !";

$enter_channel = "شناسه عددی یا آیدی عمومی کانال ایتا را بدون حرف « @ » ارسال کنید";
$channel_message = "برای ثبت کانال روی «افزودن» لمس کنید";
$no_addsign = "⚠️ آیدی را بدون « @ » ارسال کنید";
$channel_exists = "این کانال وجود دارد !";
$channel_registered = "✅ کانال با موفقیت ثبت شد";
$channel_invalid = "⚠️ کانال یافت نشد!\n\n1️⃣شناسه را به صورت صحیح ارسال کنید\n2️⃣کانال باید در سایت ایتایار ثبت شده باشد\n3️⃣ربات Sender باید در کانال ادمین باشد";
$enter_new_channel_id = "شناسه یا آیدی جدید کانال را بدون حرف « @ » ارسال کنید";
$channel_changed = "🔄 کانال با موفقیت تغییر کرد";
$channel_deleted = "✅ کانال حذف شد";
$channel_help = "کانال ایتا را می توانید از طرق دکمه «ثبت کانال» تغییر دهید";
$which_channel = "قصد انتقال محتوا به کدام کانال دارید؟";
$channel_selected = "❇️ کانال انتخاب شد: ";
$please_select_channel = "لطفا اول از دکمه «انتخاب کانال» یک کانال انتخاب کنید";

$add_new_channel = "افزودن";
$error = "خطایی رخ داد !";

$enter_channel_title = "عنوان کانال را ارسال کنید (اختیاری)";
$channel_title_registered = "✅عنوان تنظیم شد";

$enter_signature = "امضای خود را ارسال کنید";
$signature_registered = "✅ امضا ثبت شد";
$signature_deleted = "✅ امضا حذف شد";
$signature_not_exists = "⚠️ امضایی وجود ندارد !";


$enter_alternative_text = "متن جایگزین را ارسال کنید";
$alternative_text_registered = "✅ متن جایگزین ثبت شد";
$enter_original_text = "متن اصلی را ارسال کنید";
$original_text_registered = "✅ متن اصلی ثبت شد";
$changing_text_deleted = "✅ متن ها حذف شدند";
$changing_text_not_exists = "⚠️ متنی وجود ندارد !";

$forward_a_post = "🔰ابتدا ربات را ادمین کانال خود کرده و سپس یک پیام (با نقل قول) اینجا فوروارد کنید. اگر کانالی از قبل ثبت کرده باشید کانال جدید جایگزین قبلی خواهد شد.";
$please_forward = "⚠️ لطفا پیامی از کانال خود فوروارد کنید";
$bot_must_be_admin = "⚠️ ربات باید در کانال ادمین باشد";
$you_must_be_admin = "⚠️ شما باید ادمین کانال باشد !";
$channel_status_on = "✅ فعال شد";
$channel_status_off = "🚫 غیر فعال شد";
$channel_not_exists = "⚠️ کانالی وجود ندارد !";

$please_register_token = "شما هنوز توکن ایتایار خود را ثبت نکرده اید! لطفا از طریق دکمه «ثبت توکن» اقدام کنید";
$please_register_channel = "شما هیچ کانال ایتایی در ربات ثبت نکرده اید! لطفا از طریق دکمه «ثبت کانال» اقدام کنید";

$charge_not_enough = "حجم شما برای انتقال کافی نمی باشد.\nتوجه کنید که حجم شما روزانه 300 مگابایت میباشد و خودکار شارژ میشود.";

