<?php

function show_help()
{
    $message  = "🔰جهت راهنمایی در مورد هر کدام از موارد زیر دستور مقابل آن را لمس کنید\n\n";
    $message .= "🔑آموزش دریافت توکن و شناسه کانال:\n/helpGetToken\n\n";
    $message .= "🔗آموزش انتقال فایل با لینک مستقیم دانلود:\n/helpDownloadFromLink\n\n";
    $message .= "🔷ثبت کانال تلگرامی و ارسال خودکار محتوا:\n/helpAutoSender\n\n";
    $message .= "جهت راهنمایی بیشتر و بهتر به کانال اطلاع رسانی ربات مراجعه کنید:\n@EitaaSender_Channel";
    show_message($message);
}

function help_get_token()
{
    $message  = "🔑توکن یک شناسه منحصر به فرد برای هر کاربر ایتا می باشد و شبیه به کاراکترهای زیر است: \nbot88:107683e8-c826-4aa3-85c8-eff27ade9xsb\n\n";
    $message .= "شما می بایست توکن مخصوص خود را در ربات ثبت کنید\n";
    $message .= "•┈••✾••┈•\n";
    $message .= "🔰جهت دریافت توکن و شناسه کانال خود در ربات، شما نیاز دارید که در سایت ایتایار ثبت نام کنید:\neitaayar.ir\n\n";
    $message .= "🔹بعد از ثبت نام و ورود به پنل کاربری خود در سایت، یک کانال در ایتا ایجاد کرده و رباتی با نام کاربری @sender را مدیر کانال خود کنید.\n";
    $message .= "🔸سپس در سایت ایتایار، از بخش «افزودن کانال جدید» کانالی که در ایتا ایجاد کرده بودید را ثبت کنید.\n\n";
    $message .= "🔹بعد از ثبت کانال شناسه عددی کانال خود را از بخش «کانال ها» واقع در منوی سایت ایتایار، دریافت کنید.\n";
    $message .= "🔸سپس توکن خود از بخش «API» واقع در منوی سایت ایتایار، دریافت کنید.\n\n";
    $message .= "❇️بعد از دریافت این اطلاعات، جهت استفاده از ربات این اطلاعات (یعنی توکن و کانال ایتا) را ثبت کنید.\n\n";
    $message .= "@EitaaSender_Bot";
    show_message($message);
}

function help_download_from_link()
{
    $message  = "🤔لینک دانلود مستقیم چیست؟\nلینک دانلود مستقیم به لینکی میگویند که شما با باز کردن آن لینک در مرورگر گوشی فایلی شروع به دانلود شدن میکند.\n\n";
    $message .= "🔹شما در ربات میتوانید با ارسال لینک دانلود یک فایل آن را به کانال ایتا منتقل کنید.\n";
    $message .= "🔸برای اینکار شما نیاز دارید که توکن ایتایار و شناسه کانال ایتا را در ربات ثبت کنید.\n\n";
    $message .= "🔹بعد از ثبت این اطلاعات شما میتوانید از این قابلیت استفاده کنید.\n\n";
    $message .= "🔸بعد از مسیر دکمه ها «انتقال محتوا» و سپس «از لینک» لینک دانلود مورد نظرتون رو بفرستید. لینک دانلود به صورت کلی به صورت زیر هستش:\nhttp://website.com/path/FILE.exe\n\n";
    $message .= "🔹که در واقع WEBSITE.com آدرس سایت و path/FILE.exe مسیر فایل مورد نظر در سرور آن سایت می باشد.\n\n";
    $message .= "بعد از لحظاتی ربات شروع به دانلود از آن لینک و سپس انتقال فایل به کانال ایتایی خواهد کرد.\n\n";
    $message .= "✅سقف آپلود هر فایل 50 مگابایت میباشد.\n\n";
    $message .= "@EitaaSender_Bot";
    show_message($message);
}

function help_auto_sender()
{
    $message   = "🤔ارسال خودکار چیست؟\n";
    $message  .= "یعنی اگر شما یک کانال تلگرامی دارید و میخواهید محتوا ارسالی به کانال به صورت خودکار به کانال ایتا هم منتقل شود میتوانید از این قابلیت استفاده کنید.\n\n";
    $message  .= "🔹برای ثبت کانال از طریق دکمه «ارسال خودکار» در صفحه کلید اقدام کنید\n\n";
    $message  .= "🔸سپس ربات به شما یک پیام با دکمه هایی زیر آن ارسال میکند.\n";
    $message  .= "🔹از طریق دکمه «ثبت کانال» اقدام به ثبت کانال تلگرامی کنید (توضیحات تکمیلی در این بخش از ربات به شما نمایش داده خواهد شد)\n";
    $message  .= "🔸بعد از ثبت کانال تلگرام برای فعال شدن این قابلیت شما باید دکمه «غیرفعال» را به «فعال» تبدیل کنید\n";
    $message  .= "🔹این دکمه در همان قسمت بغل دکمه «ثبت کانال» می باشد.\n\n";
    $message .= "@EitaaSender_Bot";
    show_message($message);
}